literate/LexMachineTests.org
#+TITLE: Lex Machine Tests
#+PROPERTY: header-args :comments both :tangle ../test/LexMachine.test.js

* Preamble

#+begin_src js
import * as LexMachine from "../src/LexMachine.js";
import { Token } from "../src/LexicalToken";
import { interpret, Machine } from "xstate";
import { InvertedPromise as Promise } from "inverted-promise";
import { TestInterpreter, toMatchState } from "xstate-jest-tools";
import { streamFile, stream } from "../src/CharacterStream";
expect.extend({ toMatchState });

const lexMachine =
    Machine(LexMachine.definition)
        .withConfig(LexMachine.config)
        // Supply empty context to avoid warning
        .withContext({});

let interpreter;

const streamCallback = (event) => {
    interpreter.send(event);
}

beforeEach(() => {
    interpreter = TestInterpreter(lexMachine);
})
#+end_src

* Basic
Start with the simplest test:

#+begin_src js
it("Starts empty", () => {
    expect(interpreter.S).toMatchState("none");
})
#+end_src

* Blank

#+begin_src js
it("Tokenizes just a blank", () => {
    streamFile("_", streamCallback);
    expect(interpreter.S).toMatchState("done");
    expect(interpreter.C.tokens).toEqual(
        [ Token.Blank() ]);
})
#+end_src

* Comma

#+begin_src js
it("Tokenizes just a comma", () => {
    streamFile(",", streamCallback);
    expect(interpreter.S).toMatchState("done");
    expect(interpreter.C.tokens).toEqual(
        [ Token.Comma() ]);
})
#+end_src

* Value Identifier

Okay what about a complete identifier?

#+begin_src js
it("Lexes a simple alphabetic ValueIdentifier", () => {
    streamFile("abc", streamCallback);
    expect(interpreter.S).toMatchState("done");
    expect(interpreter.C.tokens).toEqual(
        [ Token.ValueIdentifier("abc").finalize() ]);
})
#+end_src

Okay what about more complex identifiers

#+begin_src js
it("Lexes a complex mixed ValueIdentifier", () => {
    streamFile("a0_z", streamCallback);
    expect(interpreter.S).toMatchState("done");
    expect(interpreter.C.tokens).toEqual(
        [ Token.ValueIdentifier("a0_z").finalize() ]);
})
#+end_src

* Address Identifier

Okay what about a complete identifier?

#+begin_src js
it("Lexes a simple alphabetic AddressIdentifier", () => {
    streamFile("@abc", streamCallback);
    expect(interpreter.S).toMatchState("done");
    expect(interpreter.C.tokens).toEqual(
        [ Token.AddressIdentifier("@abc").finalize() ]);
})
#+end_src

Okay what about more complex identifiers

#+begin_src js
it("Lexes a complex mixed AddressIdentifier", () => {
    streamFile("@a0_z", streamCallback);
    expect(interpreter.S).toMatchState("done");
    expect(interpreter.C.tokens).toEqual(
        [ Token.AddressIdentifier("@a0_z").finalize() ]);
})
#+end_src

* Label Identifiers

#+begin_src js
it("Lexes a simple alphabetic LabelIdentifier", () => {
    streamFile("abc:", streamCallback);
    expect(interpreter.S).toMatchState("done");
    expect(interpreter.C.tokens).toEqual(
        [ Token.LabelIdentifier("abc:").finalize() ]);
})
#+end_src

Okay what about more complex identifiers

#+begin_src js
it("Lexes a complex mixed LabelIdentifier", () => {
    streamFile("a0_z:", streamCallback);
    expect(interpreter.S).toMatchState("done");
    expect(interpreter.C.tokens).toEqual(
        [ Token.LabelIdentifier("a0_z:").finalize() ]);
})
#+end_src

* Call Identifiers

#+begin_src js
it("Lexes a simple alphabetic CallIdentifier", () => {
    streamFile("abc!", streamCallback);
    expect(interpreter.S).toMatchState("done");
    expect(interpreter.C.tokens).toEqual(
        [ Token.CallIdentifier("abc!").finalize() ]);
})
#+end_src

Okay what about more complex identifiers

#+begin_src js
it("Lexes a complex mixed CallIdentifier", () => {
    streamFile("a0_z!", streamCallback);
    expect(interpreter.S).toMatchState("done");
    expect(interpreter.C.tokens).toEqual(
        [ Token.CallIdentifier("a0_z!").finalize() ]);
})
#+end_src

* Numbers
What about integers?

#+begin_src js
it("Lexes an integer", () => {
    streamFile("33554432", streamCallback);
    expect(interpreter.S).toMatchState("done");
    expect(interpreter.C.tokens).toEqual(
        [ Token.Number("33554432") ]);
})
#+end_src

Decimals?

#+begin_src js
it("Lexes a decimal", () => {
    streamFile("3355.4432", streamCallback);
    expect(interpreter.S).toMatchState("done");
    expect(interpreter.C.tokens).toEqual(
        [ Token.Number("3355.4432") ]);
})
#+end_src

Numbers that end with a period are not allowed.

#+begin_src js
it("Lexing a decimal that ends with a period throws an error", () => {
    interpreter.send({ type: "NUMERIC", char: "1" });
    interpreter.send({ type: "PERIOD", char: "." });
    const fn = () => interpreter.send({ type: "EOF", char: undefined });
    expect(fn).toThrowError();
})
#+end_src

* Strings

#+begin_src js
it("Lexes a simple string", () => {
    interpreter.send({ type: "DOUBLE_QUOTE", char: "\"" })
    expect(interpreter.S).toMatchState("string");
    interpreter.send({ type: "ALPHABETIC", char: "m" })
    expect(interpreter.S).toMatchState("string");
    interpreter.send({ type: "DOUBLE_QUOTE", char: "\"" })
    expect(interpreter.S).toMatchState("none");
    interpreter.send({ type: "EOF", char: undefined });
    expect(interpreter.S).toMatchState("done");
    expect(interpreter.C.tokens).toEqual(
        [ Token.String("\"m\"") ]);
})
#+end_src

#+begin_src js
it("Lexes a string with everything except escapes", () => {
    const input = "\"abcdefghijklmnopqrstuvwxyz0123456789!@#$%^&*()+=~`<>,.[]{}|-_'?/\"";
    expect(interpreter.S)
    streamFile(input, streamCallback);
    expect(interpreter.S).toMatchState("done");
    expect(interpreter.C.tokens).toEqual(
        [ Token.String(input) ]);
})
#+end_src

#+begin_src js
it("Lexes a string with an escaped double quote", () => {
    const input = "\"\\\"\"";
    expect(interpreter.S)
    streamFile(input, streamCallback);
    expect(interpreter.S).toMatchState("done");
    expect(interpreter.C.tokens).toEqual(
        [ Token.String(input) ]);
})
#+end_src

* Tapes

#+begin_src js
it("Lexes an empty tape", () => {
    streamFile("[]", streamCallback);
    expect(interpreter.S).toMatchState("done");
    expect(interpreter.C.tokens).toEqual(
        [ Token.OpenTape(), Token.CloseTape() ]);
})
#+end_src

#+begin_src js
it("Lexes an empty tape with params", () => {
    streamFile("()[]", streamCallback);
    expect(interpreter.S).toMatchState("done");
    expect(interpreter.C.tokens).toEqual(
        [ Token.OpenParams(), Token.CloseParams(), Token.OpenTape(), Token.CloseTape() ]);
})
#+end_src

* All together

Can't be both an AddressIdentifier and a CallIdentifier

#+begin_src js
it("Cannot be both AddressIdentifier and CallIdentifier", () => {
    interpreter.send({ type: "AT_SIGN", char: "@" });
    interpreter.send({ type: "ALPHABETIC", char: "a" });
    const fn = () => interpreter.send({ type: "EXCLAMATION", char: "!" });
    expect(fn).toThrowError();
})
#+end_src

What about everything we've done so far separated by whitespace?

#+begin_src js
it("Lexes whitespace separated tokens", () => {
    streamFile("ab _ z 3 33.44", streamCallback);
    expect(interpreter.S).toMatchState("done");
    expect(interpreter.C.tokens).toEqual(
        [
            Token.ValueIdentifier("ab").finalize(),
            Token.Blank(),
            Token.ValueIdentifier("z").finalize(),
            Token.Number("3"),
            Token.Number("33.44")
        ]);
})
#+end_src

What about everything inside a tape?

#+begin_src js
it("Lexes a variety of tokens inside a tape", () => {
    streamFile("()[ ab _ z 3 33.44 ]", streamCallback);
    expect(interpreter.S).toMatchState("done");
    expect(interpreter.C.tokens).toEqual(
        [
            Token.OpenParams(),
            Token.CloseParams(),
            Token.OpenTape(),
            Token.ValueIdentifier("ab").finalize(),
            Token.Blank(),
            Token.ValueIdentifier("z").finalize(),
            Token.Number("3"),
            Token.Number("33.44"),
            Token.CloseTape(),
        ]);
})
#+end_src

* XState Interpreter =onDone()=

The machine should reach a final state if the input comes from =streamFile=.

#+begin_src js
it("XState interpreter onDone called successfully on empty file", async () => {
    const interpreter = interpret(lexMachine);
    const promise = Promise();

    interpreter.onDone(({ data }) => promise.resolve(data));
    interpreter.start();

    streamFile("", (event) => interpreter.send(event));
    expect(await promise).toEqual([]);
    interpreter.stop();
})
#+end_src

#+begin_src js
it("XState interpreter onDone called successfully on non-empty file", async () => {
    const interpreter = interpret(lexMachine);
    const promise = Promise();

    interpreter.onDone(({ data }) => promise.resolve(data));
    interpreter.start();

    streamFile("3", (event) => interpreter.send(event));
    expect(await promise).toEqual([Token.Number("3")]);
    interpreter.stop();
})
#+end_src
